#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/aws-mlops/runs/run-q2fmRF71jhgB3kNn

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
random_string.suffix: Refreshing state... [id=PvJaEFg9]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075b2168a8a54d959]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::112227029085:policy/education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221800000002]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221900000003]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333228000000004]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b18743b4b7302c8f]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-034198ad97290fcd6]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-00a9df337c017e67f]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-081c66a871fd32313]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-00ae5f3b880ec6324]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0386200f19a0ec3c9]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06dff361d9daa34ea]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02b7b75b8875b6f02]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a134ea213c4bf0e2]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02d825833703ae3e8]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0374fd609632adf7d]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00dd6ad17f28e0110]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06028b53eb644fe96]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0aff3cd4393d112eb]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-073345847327cab44]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02d825833703ae3e81080289494]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-2173523361]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-2399265100]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-38523699]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-1933826591]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-908692302]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-2053659487]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-051a53cf34f3bab1d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ba0c71fe59a51981]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029613a7fdccb2696]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07bcd2960e6d0ee52]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04417febfdd4b1957]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08033d4efa6dd5d4d]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05b5a62b36b141900]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=mlops-eks-PvJaEFg9]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06028b53eb644fe961080289494]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=c4c04be777c6d672ec2032ef5545cd702046bc6d]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202460000000b]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202660000000c]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202140000000a]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331963400000009]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331955700000008]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-22021082208433222950000000e]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-12021082208433222630000000d]
module.eks.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_security_group.worker_group_mgmt_two will be updated in-place
  ~ resource "aws_security_group" "worker_group_mgmt_two" {
        id                     = "sg-081c66a871fd32313"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.5.0/24",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "192.168.0.0/16",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "192.168.0.0/16",
                ]
              + description      = null
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
        name                   = "worker_group_mgmt_two20210822032448838900000007"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f"
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-12021082208433222630000000d" -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f"
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_autoscaling_group.workers[1] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010"
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-22021082208433222950000000e" -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010"
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] must be replaced
-/+ resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      ~ arn         = "arn:aws:iam::112227029085:policy/education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001" -> (known after apply)
      ~ id          = "arn:aws:iam::112227029085:policy/education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001" -> (known after apply)
      ~ name        = "education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001" -> (known after apply)
      ~ name_prefix = "education-eks-PvJaEFg9-elb-sl-role-creation" -> "mlops-eks-PvJaEFg9-elb-sl-role-creation" # forces replacement
      ~ policy_id   = "ANPARUIKASBOX5XGNPYYT" -> (known after apply)
        tags        = {
            "Environment" = "training"
        }
        # (4 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.cluster[0] (deposed object 1a40484c) will be destroyed
  - resource "aws_iam_role" "cluster" {
      - arn                   = "arn:aws:iam::112227029085:role/education-eks-PvJaEFg920210822032427561500000002" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "eks.amazonaws.com"
                        }
                      - Sid       = "EKSClusterAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-08-22T03:24:27Z" -> null
      - force_detach_policies = true -> null
      - id                    = "education-eks-PvJaEFg920210822032427561500000002" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::112227029085:policy/education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001",
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSServicePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "education-eks-PvJaEFg920210822032427561500000002" -> null
      - name_prefix           = "education-eks-PvJaEFg9" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "training"
        } -> null
      - tags_all              = {
          - "Environment" = "training"
        } -> null
      - unique_id             = "AROARUIKASBOXUYBBCZDB" -> null

      - inline_policy {}
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "mlops-eks-PvJaEFg920210822083332937800000001"
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:10366563-f517-403b-9925-c838311b23ef:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-12021082208433222630000000d" -> (known after apply)
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-12021082208433222630000000d" -> (known after apply)
      + key_name                         = "yushin_mac_16" # forces replacement
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-12021082208433222630000000d" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (9 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[1] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:2df858a2-e976-4b32-83fe-1c553a93bfe3:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-22021082208433222950000000e" -> (known after apply)
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-22021082208433222950000000e" -> (known after apply)
      + key_name                         = "yushin_mac_16" # forces replacement
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-22021082208433222950000000e" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (9 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://9DA9BFD5039C02838233DC7B710ECBD1.gr7.ap-southeast-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNakE0TXprMU5Wb1hEVE14TURneU1EQTRNemsxTlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTjMyCkJyOGo3N0l3YjhtZVhnMDFmUFU0MFdLR0o5YldBbVE3bDNrZkVwSnhuY3VZMjB5UlhCbmx1bGQyZTZpRm9iUHEKV1NMSGRESHlXeUZ4YkpBYmJncDBFbDlOUk1MdXBGL3ZSV2FIVGYzejcxN2l0NDVlRDRzOUVLNiswSGhPdlRLMAoySWc1VVlXbDV4V0g3ZTU3SU9URmFxS01QdEVFRTZPc2EzbDJuSDkxcy9uNEJJOGxhMjlTRnlsbmxRSmluV1dGCndYY21MZW5OM0ttUjVyaS96c243OFBDQlVzTlRiZlpUZHNzRmdDdHdYS05qMTlzWDVIcEpkY3lWOGNaVE9GMDgKZVBUQWZvcGNoMkgrS1Rta1hIYW9jVVdCMWpoTThUaGlkMGdCMGJaZFpjcTRpMFdDZEcydFJHUmkzUm1IS1MzdwpmRU5YU0w1SVJvRmpvZXFMRkY4Q0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZKT29UbEF6VjFZb3RTQ3VzeFBRcnFGeEFlK1BNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBV0JNc05ZSUt4WnVReEhGYXFldkpydUwydFZqdytxSloycWxDbUh0b1MwdHJ6WHEwQgpnaGtOZmRWekdmMldTNFJJSjJHbUxFQWtFNkh2RnFjTjFHZnFuUjRESXZYdkQ1S1VyV3lFbFBoTnVKZDJJanVhClBmamZTQXBZM3NDb091S2hLSG5ZN3pWaTUyajJkZ05wOGhUcVlMWjROQXZsbUdlSFRpZVJNRTdWT2JlUmR4VzIKMFo2QXZoOVYxV3p2R1NKZUhKQ0Z2VWZEWWF5eVJIRGxRYmJBaTg5UGFLMlZCMExsU3ArMTc3WG1WOWZTTFArZApIWHNFY2I2c0V3S1JnWWJiaWlwaTY2R0hEakFEa3kzb25pR3l1MUdyU2tNTEs2emNWRHB4WG5NSGdTbmZ0QWhtCjVRSDRPQ0RMa1UrOTFHWkE5YjRxeG5CRzBGSzJzdVJCWndEdwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_mlops-eks-PvJaEFg9
            
            contexts:
            - context:
                cluster: eks_mlops-eks-PvJaEFg9
                user: eks_mlops-eks-PvJaEFg9
              name: eks_mlops-eks-PvJaEFg9
            
            current-context: eks_mlops-eks-PvJaEFg9
            
            users:
            - name: eks_mlops-eks-PvJaEFg9
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "mlops-eks-PvJaEFg9"
        EOT
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_mlops-eks-PvJaEFg9"
      + id                   = (known after apply)
    }

Plan: 5 to add, 3 to change, 4 to destroy.

Changes to Outputs:
  ~ config_map_aws_auth = [
      ~ {
          ~ binary_data = null -> {}
          ~ metadata    = [
              ~ {
                  ~ annotations      = null -> {}
                    # (7 unchanged elements hidden)
                },
            ]
            # (2 unchanged elements hidden)
        },
    ]

```
</details>
*Pusher: @yushindkang, Action: `pull_request`*